# Fundamentials of Data Analysis Project 2019.

## Libraries

In [14]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

## Loading the dataset 
Here I have used seaborn to load the csv file data. From this point I wold like to visually see how it is structured so I used the tips.head(2) to show me the first two lines only. If you prefer to view more rows simply put the number that you want to view in the (). This can also be completed from the bottom of the dataframe using tips.tail(?)

In [15]:
tips = sns.load_dataset("tips")
tips.head(2)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

We can also view whole or parts of columns. The blow example will show the first five rows of the tip column and will also display that the data type is a float

In [16]:
tips["tip"].head()

0    1.01
1    1.66
2    3.50
3    3.31
4    3.61
Name: tip, dtype: float64

We could use the different lines of code to find the mean, median etc but all of this can be viewed using the .describe() command below.

In [18]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

Group based on gender so we can see of men or

In [21]:
group = tips.groupby("sex")

In [22]:
group.sum()

        total_bill     tip  size
sex
Male       3256.82  485.07   413
Female     1570.95  246.51   214